Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The temporary directory used for storing files when doing file upload.
pt_br: O diretório temporário utilizado para armazenar arquivos quando realizando o upload de arquivos.

source: Must be writable by whatever user PHP is running as.
pt_br: Ele precisa ter permissão de escrita para qualquer usuário que for rodar o PHP.

source: If not specified PHP will use the system 's default.
pt_br: Se não especificado, o PHP utilizará o default do sistema.

source: The maximum size of an uploaded file.
pt_br: O tamanho máximo de um arquivo para upload.

source: Table 4-8.
pt_br: SQL Geral

source: General SQL Configuration Options
pt_br: Opções de configuração SQL gerais

source: DNS name or IP address of host used by the debugger.
pt_br: Nome DNS ou endereço IP do host utilizado pelo debugador.

source: Port number used by the debugger.
pt_br: Porta utilizado pelo debugador.

source: Whether the debugger is enabled.
pt_br: Controle de ativação do debugador.

source: How to change configuration settings
pt_br: Como alterar as configurações definidas

source: The configuration file (called php3.ini in PHP 3.0, and simply php.ini as of PHP 4.0) is read when PHP starts up.
pt_br: Configuração

source: For the server module versions of PHP, this happens only once when the web server is started.
pt_br: O arquivo de configuração (chamado php3.ini no PHP 3.0, e simplesmente php.ini no PHP 4.0) é lido quando o PHP inicia.

source: For the CGI and CLI version, it happens on every invocation.
pt_br: Para as versões de módulos de servidor do PHP, isso só acontece uma vez quando o servidor é iniciado.

source: The default location of php.ini is a compile time option (see the FAQ entry), but can be changed for the CGI and CLI version with the -c command line switch, see the chapter about using PHP from the command line.
pt_br: A localização padrão do php.ini é uma opção de compilação (veja a FAQ correspondente), mas pode ser modificada para as versões CGI e CLI com o opcional -c (mais informações em utilizando o PHP na linha de comando).

source: You can also use the environment variable PHPRC for an additional path to search for a php.ini file.
pt_br: Você também pode utilizar a variavável ambiente PHPRC para colocar caminhos adicionais para a procura do arquivo php.ini.

source: Not every PHP directive is documented below.
pt_br: Note que nem todas as diretivas do PHP estão documentadas a seguir.

source: For a list of all directives, please read your well commented php.ini file.
pt_br: Para uma lista completa, leia o seu próprio e bem comentado arquivo php.ini.

source: You may want to view the latest php.ini here from CVS.
pt_br: Você também pode ver a versão mais atualizada diretamente do CVS.

source: The default value for the PHP directive register_globals changed from on to off in PHP 4.2.0.
pt_br: O valor default da diretiva register_globals mudou de on para off a partir do PHP 4.2.0.

source: Example 4-1. php.ini example
pt_br: Exemplo 4-1. php.ini example

source: ; any text on a line after an unquoted semicolon (;) is ignored [php]; section markers (text within square brackets) are also ignored; Boolean values can be set to either:; true, on, yes; or false, off, no, none register_globals = off magic_quotes_gpc = yes; you can enclose strings in double-quotes include_path = ".: / usr / local / lib / php "; backslashes are treated the same as any other character include_path = ".;c:\php\lib"
pt_br: ; qualquer texto depois de um ponto e vírgula não delimitado (;) é ignorado [php]; marcadores de seção (texto entre colchetes) também são ignorados; Valores booleanos podem ser:; true, on, yes; ou false, off, no, none register_globals = off magic_quotes_gpc = yes; você pode delimitar strings com aspas include_path = ".: / usr / local / lib / php "; barras invertidas são tratadas da mesma maneira que outros caracteres include_path = ".;c:\php\lib"

source: PHP offers an alternative syntax for some of its control structures; namely, if, while, for, foreach, and switch.
pt_br: O PHP oferece uma sintaxe alternativa para algumas das suas estruturas de controle: if, while, for, foreach e switch.

source: In each case, the basic form of the alternate syntax is to change the opening brace to a colon (:) and the closing brace to endif;, endwhile;, endfor;, endforeach;, or endswitch;, respectively.
pt_br: Em cada caso, a forma básica da sintaxe alternativa é mudar o sinal de abertura para dois-pontos (:) e o sinal de fechamento para endif;, endwhile;, endfor;, endforeach; ou endswitch;, respectivamente.

source: A is equal to 5 ?php endif;?
pt_br: A é igual a 5 ?php endif;?

source: In the above example, the HTML block "A is equal to 5" is nested within an if statement written in the alternative syntax.
pt_br: No exemplo acima, o bloco HTML "A é igual a 5" está aninhado dentro de uma instrução if No exemplo acima, o bloco HTML "A é igual a 5 "está aninhado dentro de uma instrução if escrito na sintaxe alternativa.

source: The HTML block would be displayed only if $a is equal to 5.
pt_br: O bloco HTML será mostrado somente se $a é igual a 5.

source: The alternative syntax applies to else and elseif as well.
pt_br: A sintaxe alternativa se aplica a else e elseif também.

source: The following is an if structure with elseif and else in the alternative format:
pt_br: A seguir temos uma estrutura if com elseif e else no formato alternativo:

source: if ($a == 5): print "a equals 5"; print ".. ."; elseif ($a == 6): print "a equals 6"; print "!! !"; else: print "a is neither 5 nor 6"; endif;
pt_br: if ($a == 5): print "a igual a 5"; print ".. ."; elseif ($a == 6): print "a igual a 6"; print "!! !"; else: print "a não é nem 5 nem 6"; endif;

source: See also while, for, and if for further examples.
pt_br: Veja também: while, for e if para mais exemplos.

source: break ends execution of the current for, foreach while, do..while or switch structure.
pt_br: break cancela a execução do comando for, foreach while, do..while ou switch atual.

source: break accepts an optional numeric argument which tells it how many nested enclosing structures are to be broken out of.
pt_br: break aceita um argumento numérico opcional que diz a ele quantas estruturas aninhadas englobadas devem ser quebradas.

source: $arr = array ('one', 'two', 'three', 'four', 'stop', 'five'); while (list (, $val) = each ($arr)) {if ($val == 'stop') {break; / * You could also write'break 1; 'here. * /} echo "$val br \n";} / * Using the optional argument. * / $i = 0; while (++$i) {switch ($i) {case 5: echo "At 5 br \n"; break 1; / * Exit only the switch. * / case 10: echo "At 10; quitting br \n"; break 2; / * Exit the switch and the while. * / default: break;}}
pt_br: $arr = array ('um', 'dois', 'três', 'quatro', 'PARE', 'cinco'); while (list (, $val) = each ($arr)) {if ($val == 'PARE') {break; / * Você poderia colocar 'break 1; 'aqui. * /} echo "$val br \n";} / * Utilizando o argumento opcional. * / $i = 0; while (++$i) {switch ($i) {case 5: echo "No 5 br \n"; break 1; / * Sai somente do switch. * / case 10: echo "No 10; saindo br \n"; break 2; / * Sai do switch e while. * / default: break;}}

source: continue is used within looping structures to skip the rest of the current loop iteration and continue execution at the beginning of the next iteration.
pt_br: continue é usado dentro de estruturas de loops para saltar o resto da iteração do loop atual e continuar a execução no início da próxima iteração.

source: continue accepts an optional numeric argument which tells it how many levels of enclosing loops it should skip to the end of.
pt_br: continue aceita um argumento numérico opcional que diz a ele de quantos níveis de loops aninhados ele deve saltar até o fim.

source: while (list ($key, $value) = each ($arr)) {if (!($key% 2)) {/ / skip odd members continue;} do_something_odd ($value);} $i = 0; while ($i+ + 5) {echo "Outer br \n"; while (1) {echo "nbsp; nbsp;Middle br \n"; while (1) {echo" nbsp; nbsp;Inner br \n"; continue 3;} echo "This never gets output. br \n";} echo "Neither does this. br \n";}
pt_br: while (list ($key, $value) = each ($arr)) {if (!($key% 2)) {/ / pula itens pares continue;} do_something_odd ($value);} $i = 0; while ($i+ + 5) {echo "Fora br \n"; while (1) {echo "nbsp; nbsp;Meio br \n"; while (1) {echo" nbsp; nbsp;Dentro br \n"; continue 3;} echo "Isto nunca será exibido. br \n";} echo "Nem isso. br \n";}

source: The declare construct is used to set execution directives for a block of code.
pt_br: O construtor declare é utilizado para configurar diretivas de execução para blocos de código.

source: The syntax of declare is similar to the syntax of other flow control constructs:
pt_br: A sintaxe do declare é similar a sintaxe de outros construtores de controle.

source: declare (directive) statement
pt_br: declare (diretiva) instrucao

source: The directive section allows the behavior of the declare block to be set.
pt_br: A seção diretiva permite o comportamento do bloco declare a ser configurado.

source: Currently only one directive is recognized: the ticks directive. (See below for more information on the ticks directive)
pt_br: Atualmente somente uma diretiva é reconhecida: a diretiva ticks. (veja abaixo para maiores informações em diretiva ticks)

source: The statement part of the declare block will be executed - - how it is executed and what side effects occur during execution may depend on the directive set in the directive block.
pt_br: Como ela é executada e que efeitos colaterais que podem ocorrem durante a execução dependem da configuração diretiva.

source: A tick is an event that occurs for every N low-level statements executed by the parser within the declare A tick is an event that occurs for every N low-level statements executed by the parser within the declare block.
pt_br: Um tick é um evento que ocorre para cada N níveis de instruções executados pelo interpretador com o bloco declare.

source: The value for N is specified using ticks= N within the declare blocks' s directive section.
pt_br: O valor para N é especificado utilizando ticks= N nos blocos declare das seções diretiva.

source: The event( s) that occur on each tick are specified using the register_tick_function().
pt_br: O( s) evento(s) que ocorre(m) em cada tick são especificados utilizando register_tick_function().

source: See the example below for more details.
pt_br: Veja o exemplo abaixo para maiores detalhes.

source: Note that more than one event can occur for each tick.
pt_br: Note que mais de um evento pode ocorrer em cada tick.

source: Example 12-1.
pt_br: Exemplo 12-1.

source: Profile a section of PHP code
pt_br: Histórico de um trecho de código PHP

source: ?php / / A function that records the time when it is called function profile ($dump = FALSE) {static $profile; / / Return the times stored in profile, then erase it if ($dump) {$temp = $profile; unset ($profile); return ($temp);} $profile[] = microtime ();} / / Set up a tick handler register_tick_function("profile"); / / Initialize the function before the declare block profile (); / / Run a block of code, throw a tick every 2nd statement declare (ticks=2) {for ($x = 1; $x 50; ++$x) {echo similar_text (md5($x), md5($x*$x)), "br / ;";}} / / Display the data stored in the profiler print_r (profile (TRUE));?
pt_br: ?php / / Uma função que grava o tempo entre as chamadas function profile ($dump = FALSE) {static $profile; / / Retorna os tempos preservados no histórico, então apaga if ($dump) {$temp = $profile; unset ($profile); return ($temp);} $profile[] = microtime ();} / / Ativa o manipulador do tick register_tick_function("profile"); / / Inicializa a função antes de declarar o bloco profile (); / / Roda um trecho de código, disparando um tick a cada duas instruções declare (ticks=2) {for ($x = 1; $x 50; ++$x) {echo similar_text (md5($x), md5($x*$x)), "br / ;";}} / / Mostra os dados guardados no histórico print_r (profile (TRUE));?

source: Ticks are well suited for debugging, implementing simple multitasking, backgrounded I / O and many other tasks.
pt_br: Ticks são idealizados para debug, implementação de multitask simples, processos de I / O em background e afins.

source: See also register_tick_function() and unregister_tick_function().
pt_br: Veja também: register_tick_function() e unregister_tick_function().

source: do..while loops are very similar to while loops, except the truth expression is checked at the end of each iteration instead of in the beginning.
pt_br: Loops do..while são bem similares aos loops while, exceto pelo fato de que a condição é verificada no fim de cada iteração em vez de no começo.

source: The main difference from regular while loops is that the first iteration of a do..while loop is guaranteed to run (the truth expression is only checked at the end of the iteration), whereas it's may not necessarily run with a regular while loop (the truth expression is checked at the beginning of each iteration, if it evaluates to FALSE right from the beginning, the loop execution would end immediately).
pt_br: A diferença principal dos loops while regulares é que a primeira iteração de um loop do..while é garantidamente executada (a condição só é verificada no fim da iteração) enquanto que ele pode não rodar necessariamente em um loop while normal (a condição é verificada no começo de cada iteração, se ela é avaliada como FALSE logo no começo, a execução do loop terminaria imediatamente).

source: There is just one syntax for do..while loops:
pt_br: Há apenas uma sintaxe para loops do..while:

source: The above loop would run one time exactly, since after the first iteration, when truth expression is checked, it evaluates to FALSE ($i is not bigger than 0) and the loop execution ends.
pt_br: O loop acima rodaria exatamente uma vez, desde que depois da primeira iteração, quando a condição é verificada, ela é avaliada como FALSE ($i não é maior que zero 0) e a execução do loop termina.

source: Advanced C users may be familiar with a different usage of the do..while loop, to allow stopping execution in the middle of code blocks, by encapsulating them with do..while (0), and using the break statement.
pt_br: Usuários avançados de C podem estar familiarizados com o uso diferenciado do loop do..while, para permitir o fim da execução no meio dos blocos de código, englobando-os com do..while (0), e usando a instrução break.

source: The following code fragment demonstrates this:
pt_br: O fragmento de código a seguir demonstra isso:

source: do {if ($i 5) {print "i is not big enough"; break;} $i *= $factor; if ($i $minimum_limit) {break;} print "i is ok"; ...process i...} while(0);
pt_br: do {if ($i 5) {print "i não é grande o suficiente"; break;} $i *= $factor; if ($i $minimum_limit) {break;} print "i está Ok"; ...process i...} while(0);

source: Don' t worry if you don't understand this right away or at all.
pt_br: Não se preocupe se você não entendeu isto da forma certa ou de jeito nenhum.

source: You can code scripts and even powerful scripts without using this' feature '.
pt_br: Você pode codificar scripts simples ou mesmo poderosos sem usar esse 'recurso'.

source: Often you 'd want to execute a statement if a certain condition is met, and a different statement if the condition is not met.
pt_br: Freqüentemente você vai querer executar uma instrução se uma certa condição for encontrada, e uma instrução diferente se a condição não for encontrada.

source: This is what else is for. else extends an if statement to execute a statement in case the expression in the if statement evaluates to FALSE.
pt_br: Isto é o que o else faz. else estende um comando if para executar uma instrução caso a expressão no comando if seja avaliada como FALSE.

source: For example, the following code would display a is bigger than b if $a is bigger than $b, and a is NOT bigger than b otherwise:
pt_br: Por exemplo, o código a seguir mostraria a é maior que b se $a for maior que $b, e a NÃO é maior que b caso contrário:

source: if ($a $b) {print "a is bigger than b";} else {print "a is NOT bigger than b";}
pt_br: if ($a $b) {print "a é maior que b";} else {print "a NÃO é maior que b";}

source: elseif, as its name suggests, is a combination of if and else.
pt_br: elseif, como seu nome sugere, é uma combinação de if e else.

source: Like else, it extends an if statement to execute a different statement in case the original if expression evaluates to FALSE.
pt_br: Da mesma forma que o else, ele estende um comando if para executar uma instrução diferente no caso de a expressão if original ser avaliada como FALSE.

source: However, unlike else, it will execute that alternative expression only if the elseif conditional expression evaluates to TRUE.
pt_br: Porém, ao contrário de else, ele executará aquela expressão alternativa somente se a expressão condicional do elseif for avaliada como TRUE.

source: For example, the following code would display a is bigger than b, a equal to b or a is smaller than b:
pt_br: Por exemplo, o código a seguir mostraria a é maior que b, a é igual a b ou a é menor que b:

source: if ($a $b) {print "a is bigger than b";} elseif ($a == $b) {print "a is equal to b";} else {print "a is smaller than b";}
pt_br: if ($a $b) {print "a é maior que b";} elseif ($a == $b) {print "a é igual a b";} else {print "a é menor que b b";}

source: There may be several elseif s within the same if statement.
pt_br: Podem haver vários elseif s dentro da mesma instrução if.

source: The first elseif expression (if any) that evaluates to TRUE would be executed.
pt_br: A primeira expressão elseif (se houver) que for avaliada como TRUE será executada.

source: In PHP, you can also write 'else if' (in two words) and the behavior would be identical to the one of'elseif '(in a single word).
pt_br: No PHP, você também pode escrever 'else if' (em duas palavras) e o comportamento será idêntico a um 'elseif '(em uma só palavra).

source: The syntactic meaning is slightly different (if you're familiar with C, this is the same behavior) but the bottom line is that both would result in exactly the same behavior.
pt_br: O significado sintático é ligeiramente diferente (se você está familiarizado com C, eles tem o mesmo comportamento), mas no final de contas ambos teriam exatamente o mesmo comportamento.

source: The elseif statement is only executed if the preceding if expression and any preceding elseif expressions evaluated to FALSE, and the current elseif expression evaluated to TRUE.
pt_br: O comando elseif só é executado se a expressão if precedente e quaisquer expressões elseif anteriores forem avaliadas como FALSE, e a expressão elseif atual for avaliada como TRUE.

source: Alternative syntax for control structures
pt_br: Sintaxe alternativa para estruturas de controle

source: PHP 4 (not PHP 3) includes a foreach construct, much like Perl and some other languages.
pt_br: O PHP4 (mas não o PHP3) inclui um construtor foreach, muito parecido com o PERL e outras linguagens.

source: This simply gives an easy way to iterate over arrays. foreach works only on arrays, and will issue an error when you try to use it on a variable with a different data type or an uninitialized variables.
pt_br: Isto oferece uma maneira fácil de iterar sobre matrizes. foreach funciona somente com arrays, e lançará um erro se tentar utilizá-lo em uma variável de qualquer tipo diferente ou em variáveis não inicializadas.

source: There are two syntaxes; the second is a minor but useful extension of the first:
pt_br: Há duas sintaxes; a segunda é uma abreviatura, mas útil, da primeira:

source: foreach( array_expression as $value) statement foreach(array_expression as $key = $value) statement
pt_br: foreach( expressao_array as $valor) instrucoes foreach(expressao_array as $chave = $valor) instrucoes

source: The first form loops over the array given by array_expression.
pt_br: A primeira forma varre uma dada matriz dada por expressao_array.

source: On each loop, the value of the current element is assigned to $value and the internal array pointer is advanced by one (so on the next loop, you'll be looking at the next element).
pt_br: Em cada 'loop', o valor do elemento corrente é atribuído a $valor e o ponteiro interno da matriz é avançado em uma posição (assim, no próxima iteração você estará olhando para o próximo elemento).

source: The second form does the same thing, except that the current element 's key will be assigned to the variable $key on each loop.
pt_br: A segunda forma faz a mesma coisa, exceto pelo fato de que a chave do elemento atual será atribuído à variável $chave em cada iteração.

source: When foreach first starts executing, the internal array pointer is automatically reset to the first element of the array.
pt_br: Quando o foreach Quando o foreach inicia sua primeira execução, o ponteiro interno da matriz é zerado automaticamente para o primeiro elemento do array.

source: This means that you do not need to call reset() before a foreach loop.
pt_br: Isto significa que você não precisa chamar reset() antes de um loop foreach.

source: However, the internal pointer of the original array is advanced with the processing of the array.
pt_br: Note também que foreach opera sobre uma cópia do array especificado, não o próprio array, portanto o ponteiro da array não é modificado como na instrução each(), que altera o elemento do array selecionado, mas isso não se reflete o array original.

source: You may have noticed that the following are functionally identical:
pt_br: Você pode ter notado que os seguintes itens são funcionalmente idênticos:

source: reset ($arr); while (list(, $value) = each ($arr)) {echo "Value: $value br \n";} foreach ($arr as $value) {echo "Value: $value br \n";}
pt_br: reset ($arr); while (list(, $value) = each ($arr)) {echo "Valor: $value br \n";} foreach ($arr as $value) {echo "Valor: $value br \n";}

source: reset ($arr); while (list($key, $value) = each ($arr)) {echo "Key: $key; Value: $value br \n";} foreach ($arr as $key = $value) {echo "Key: $key; Value: $value br \n";}
pt_br: reset ($arr); while (list($key, $value) = each ($arr)) {echo "Chave: $key; Valor: $value br \n";} foreach ($arr as $key = $value) {echo "Chave: $key; Valor: $value br \n";}

source: Some more examples to demonstrate usages:
pt_br: Mais alguns exemplos para demonstrar os usos:

source: /* foreach example 1: value only * / $a = array (1, 2, 3, 17); foreach ($a as $v) {print "Current value of \$a: $v.\n";} / * foreach example 2: value (with key printed for illustration) * / $a = array (1, 2, 3, 17); $i = 0; / * for illustrative purposes only * / foreach($a as $v) {print "\$a[$i] = $v.\n"; $i++;} / * foreach example 3: key and value * / $a = array ("one "= 1, "two" = 2, "three "= 3, "seventeen" = 17); foreach($a as $k = $v) {print "\$a[$k] = $v.\n";} / * foreach example 4: multi-dimensional arrays * / $a[0][0] = "a"; $a[0][1] = "b"; $a[1][0] = "y"; $a[1][1] = "z"; foreach($a as $v1) {foreach ($v1 as $v2) {print "$v2\n";}} / * foreach example 5: dynamic arrays * / foreach(array(1, 2, 3, 4, 5) as $v) {print "$v\n";}
pt_br: /* exemplo foreach 1: somente valores * / $a = array (1, 2, 3, 17); foreach ($a as $v) {print "Valor atual de \$a: $v.\n";} / * exemplo foreach 2: valores (com as chaves impressas para ilustração) * / $a = array (1, 2, 3, 17); $i = 0; / * para exemplo somente * / foreach($a as $v) {print "\$a[$i] = $v.\n"; $i++;} / * exemplo foreach 3: chaves e valores * / $a = array ("um "= 1, "dois" = 2, "três "= 3, "dezessete" = 17); foreach($a as $k = $v) {print "\$a[$k] = $v.\n";} / * exemplo foreach 4: arrays multidimensionais * / $a[0][0] = "a"; $a[0][1] = "b"; $a[1][0] = "y"; $a[1][1] = "z"; foreach($a as $v1) {foreach ($v1 as $v2) {print "$v2\n";}} / * exemplo foreach 5: arrays dinâmicos * / foreach(array(1, 2, 3, 4, 5) as $v) {print "$v\n";}
